package com.daffy3.ch01;

public class Intro {
    // 01. 객체 간의 상속은 어떤 의미일까?
    // 클래스 상속
    // - 새로운 클래스를 정의할 때, 이미 구현된 클래스를 상속받아서 속성이나 기능을 확장하여 클래스를 구현한다.
    // - 이미 구현된 클래스보다 더 구체적인 기능을 가진 클래스를 구현해야 할 때, 기존 클래스를 상속한다.
    // - A클래스가 B클래스에게 상속한다. === B클래스가 A클래스를 상속받는다.
    // - class B extends A { }의 구조
    // - 자바에서는 extends 키워드 뒤에는 단 하나의 클래스만 올 수 있다.

    // 상속을 구현하는 경우
    // - 상위 클래스는 하위 클래스를 보다 더 일반적인 개념과 기능을 가진다.
    // - 하위 클래스는 상위 클래스 보다 더 구체적인 개념과 기능을 가진다.
    // - 하위 클래스가 상위 클래스의 속성과 기능을 확장한다는 의미이다.
}
