package com.daffy3.ch13;

public class Intro {
    // 20. 자료를 순차적으로 한꺼번에 관리하는 방법 - 배열 Array

    // 배열이란?
    // - 동일한 자료형의 순차적 자료구조
    // - 인덱스 연산자 []를 이용하여 빠른 참조가 가능
    // - 물리적 위치와 논리적 위치가 동일
    // - 배열의 순서는 0부터 시작
    // - 자바에서는 객체 배열을 구현한 ArrayList를 많이 활용
    // - 배열은 개수를 선언한다. 그래야 사이즈가 잡힌다.
    // - 배열은 몇 번째 요소를 빼오는 데 걸리는 시간이 짧다. 빠르다.

    // 배열의 길이와 요소의 개수는 동일하지 않다.
    // - 배열을 선언하면 개수만큼 메모리가 할당되지만, 실제 요소(데이터)가 없는 경우도 있다.
    // - 배열의 length 속성은 배열의 개수를 반환해주기 때문에 요소의 개수와는 다른다.

    // 향상된 for문 사용하기
    // 배열의 n개 요소를 0부터 n-1까지 순차적으로 순회할 때, 간단하게 사용할 수 있다.
    // for (변수 : 배열){ }
}
